cfg/ChartsOfCalculationTypes/ВзносыВФонды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<ChartOfCalculationTypes>
		<Properties>
			<Name>ВзносыВФонды</Name>
			<BaseCalculationTypes>
				<xr:Item>ChartOfCalculationTypes.ОсновныеНачисленияОрганизаций</xr:Item>
			</BaseCalculationTypes>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СпособРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРасчетаОплатыТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРасчетаПоШкале</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРасчетаПоШкале</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаПоПериодуРегистрации</Name>
					<Comment>Алгоритм расчета взносов по ставке на период регистрации</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КатегорииРасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕСВ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Name</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCalculationTypes>
</MetaDataObject>

cfg/InformationRegisters/НастройкаОбновленияВидовРасчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>НастройкаОбновленияВидовРасчета</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НеОбновлятьАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеОбновлятьТабличныеЧасти</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПланВидовРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПланыВидовРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.УдержанияОрганизаций</v8:Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.ВзносыВФонды</v8:Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.СреднийЗаработок</v8:Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.ОсновныеНачисленияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfg/Enums/ПланыВидовРасчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ПланыВидовРасчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсновныеНачисленияОрганизаций</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдержанияОрганизаций</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносыВФонды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СреднийЗаработок</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfg/ChartsOfCalculationTypes/ВзносыВФонды/Forms/ФормаСписка/Ext/Form/Module.bsl
Процедура ДействияФормыНастройкаОбновления(Кнопка)
	
	Форма = РегистрыСведений.НастройкаОбновленияВидовРасчета.ПолучитьФормуСписка();
	Форма.РегистрСведенийСписок.Отбор.ПланВидовРасчета.Использование = Истина;
	Форма.РегистрСведенийСписок.Отбор.ПланВидовРасчета.ВидСравнения = ВидСравнения.Равно;
	Форма.РегистрСведенийСписок.Отбор.ПланВидовРасчета.Значение = Перечисления.ПланыВидовРасчета.ВзносыВФонды;
	Форма.Открыть();
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	Если ПроведениеРасчетов.ИспользуетсяЕСВ() Тогда
		ПланВидовРасчетаСписок.Отбор.Актуальность.Значение = Истина;
		ПланВидовРасчетаСписок.Отбор.Актуальность.ВидСравнения = ВидСравнения.Равно;
		ПланВидовРасчетаСписок.Отбор.Актуальность.Использование = Истина;
    КонецЕсли;
	
КонецПроцедуры
